zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K341_EMAC.h
#define EMAC_MAC_RX_TX_STATUS_NCARR_MASK         (0x2U)
#define EMAC_MAC_RX_TX_STATUS_NCARR_SHIFT        (1U)
#define EMAC_MAC_RX_TX_STATUS_NCARR_WIDTH        (1U)
#define EMAC_MAC_RX_TX_STATUS_NCARR(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_NCARR_SHIFT)) & EMAC_MAC_RX_TX_STATUS_NCARR_MASK)

#define EMAC_MAC_RX_TX_STATUS_LCARR_MASK         (0x4U)
#define EMAC_MAC_RX_TX_STATUS_LCARR_SHIFT        (2U)
#define EMAC_MAC_RX_TX_STATUS_LCARR_WIDTH        (1U)
#define EMAC_MAC_RX_TX_STATUS_LCARR(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_LCARR_SHIFT)) & EMAC_MAC_RX_TX_STATUS_LCARR_MASK)

#define EMAC_MAC_RX_TX_STATUS_EXDEF_MASK         (0x8U)
#define EMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT        (3U)
#define EMAC_MAC_RX_TX_STATUS_EXDEF_WIDTH        (1U)
#define EMAC_MAC_RX_TX_STATUS_EXDEF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT)) & EMAC_MAC_RX_TX_STATUS_EXDEF_MASK)

#define EMAC_MAC_RX_TX_STATUS_LCOL_MASK          (0x10U)
#define EMAC_MAC_RX_TX_STATUS_LCOL_SHIFT         (4U)
#define EMAC_MAC_RX_TX_STATUS_LCOL_WIDTH         (1U)
#define EMAC_MAC_RX_TX_STATUS_LCOL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_LCOL_SHIFT)) & EMAC_MAC_RX_TX_STATUS_LCOL_MASK)

#define EMAC_MAC_RX_TX_STATUS_EXCOL_MASK         (0x20U)
#define EMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT        (5U)
#define EMAC_MAC_RX_TX_STATUS_EXCOL_WIDTH        (1U)
#define EMAC_MAC_RX_TX_STATUS_EXCOL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT)) & EMAC_MAC_RX_TX_STATUS_EXCOL_MASK)

#define EMAC_MAC_RX_TX_STATUS_RWT_MASK           (0x100U)
#define EMAC_MAC_RX_TX_STATUS_RWT_SHIFT          (8U)
#define EMAC_MAC_RX_TX_STATUS_RWT_WIDTH          (1U)
#define EMAC_MAC_RX_TX_STATUS_RWT(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_RWT_SHIFT)) & EMAC_MAC_RX_TX_STATUS_RWT_MASK)
/*! @} */

/*! @name MAC_VERSION - MAC Version */
/*! @{ */

#define EMAC_MAC_VERSION_IPVER_MASK              (0xFFU)
#define EMAC_MAC_VERSION_IPVER_SHIFT             (0U)
#define EMAC_MAC_VERSION_IPVER_WIDTH             (8U)
#define EMAC_MAC_VERSION_IPVER(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VERSION_IPVER_SHIFT)) & EMAC_MAC_VERSION_IPVER_MASK)

#define EMAC_MAC_VERSION_CFGVER_MASK             (0xFF00U)
#define EMAC_MAC_VERSION_CFGVER_SHIFT            (8U)
#define EMAC_MAC_VERSION_CFGVER_WIDTH            (8U)
#define EMAC_MAC_VERSION_CFGVER(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VERSION_CFGVER_SHIFT)) & EMAC_MAC_VERSION_CFGVER_MASK)
/*! @} */

/*! @name MAC_DEBUG - MAC Debug */
/*! @{ */

#define EMAC_MAC_DEBUG_RPESTS_MASK               (0x1U)
#define EMAC_MAC_DEBUG_RPESTS_SHIFT              (0U)
#define EMAC_MAC_DEBUG_RPESTS_WIDTH              (1U)
#define EMAC_MAC_DEBUG_RPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_RPESTS_SHIFT)) & EMAC_MAC_DEBUG_RPESTS_MASK)

#define EMAC_MAC_DEBUG_RFCFCSTS_MASK             (0x6U)
#define EMAC_MAC_DEBUG_RFCFCSTS_SHIFT            (1U)
#define EMAC_MAC_DEBUG_RFCFCSTS_WIDTH            (2U)
#define EMAC_MAC_DEBUG_RFCFCSTS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_RFCFCSTS_SHIFT)) & EMAC_MAC_DEBUG_RFCFCSTS_MASK)

#define EMAC_MAC_DEBUG_TPESTS_MASK               (0x10000U)
#define EMAC_MAC_DEBUG_TPESTS_SHIFT              (16U)
#define EMAC_MAC_DEBUG_TPESTS_WIDTH              (1U)
#define EMAC_MAC_DEBUG_TPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_TPESTS_SHIFT)) & EMAC_MAC_DEBUG_TPESTS_MASK)

#define EMAC_MAC_DEBUG_TFCSTS_MASK               (0x60000U)
#define EMAC_MAC_DEBUG_TFCSTS_SHIFT              (17U)
#define EMAC_MAC_DEBUG_TFCSTS_WIDTH              (2U)
#define EMAC_MAC_DEBUG_TFCSTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_TFCSTS_SHIFT)) & EMAC_MAC_DEBUG_TFCSTS_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE0 - MAC Hardware Feature 0 */
/*! @{ */

#define EMAC_MAC_HW_FEATURE0_MIISEL_MASK         (0x1U)
#define EMAC_MAC_HW_FEATURE0_MIISEL_SHIFT        (0U)
#define EMAC_MAC_HW_FEATURE0_MIISEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_MIISEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_MIISEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_MIISEL_MASK)

#define EMAC_MAC_HW_FEATURE0_GMIISEL_MASK        (0x2U)
#define EMAC_MAC_HW_FEATURE0_GMIISEL_SHIFT       (1U)
#define EMAC_MAC_HW_FEATURE0_GMIISEL_WIDTH       (1U)
#define EMAC_MAC_HW_FEATURE0_GMIISEL(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_GMIISEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_GMIISEL_MASK)

#define EMAC_MAC_HW_FEATURE0_HDSEL_MASK          (0x4U)
#define EMAC_MAC_HW_FEATURE0_HDSEL_SHIFT         (2U)
#define EMAC_MAC_HW_FEATURE0_HDSEL_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE0_HDSEL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_HDSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_HDSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_PCSSEL_MASK         (0x8U)
#define EMAC_MAC_HW_FEATURE0_PCSSEL_SHIFT        (3U)
#define EMAC_MAC_HW_FEATURE0_PCSSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_PCSSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_PCSSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_PCSSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_VLHASH_MASK         (0x10U)
#define EMAC_MAC_HW_FEATURE0_VLHASH_SHIFT        (4U)
#define EMAC_MAC_HW_FEATURE0_VLHASH_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_VLHASH(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_VLHASH_SHIFT)) & EMAC_MAC_HW_FEATURE0_VLHASH_MASK)

#define EMAC_MAC_HW_FEATURE0_SMASEL_MASK         (0x20U)
#define EMAC_MAC_HW_FEATURE0_SMASEL_SHIFT        (5U)
#define EMAC_MAC_HW_FEATURE0_SMASEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_SMASEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_SMASEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_SMASEL_MASK)

#define EMAC_MAC_HW_FEATURE0_RWKSEL_MASK         (0x40U)
#define EMAC_MAC_HW_FEATURE0_RWKSEL_SHIFT        (6U)
#define EMAC_MAC_HW_FEATURE0_RWKSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_RWKSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_RWKSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_RWKSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_MGKSEL_MASK         (0x80U)
#define EMAC_MAC_HW_FEATURE0_MGKSEL_SHIFT        (7U)
#define EMAC_MAC_HW_FEATURE0_MGKSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_MGKSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_MGKSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_MGKSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_MMCSEL_MASK         (0x100U)
#define EMAC_MAC_HW_FEATURE0_MMCSEL_SHIFT        (8U)
#define EMAC_MAC_HW_FEATURE0_MMCSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_MMCSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_MMCSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_MMCSEL_MASK)

