zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K341_EMAC.h
#define EMAC_MAC_HW_FEATURE1_DBGMEMA_MASK        (0x80000U)
#define EMAC_MAC_HW_FEATURE1_DBGMEMA_SHIFT       (19U)
#define EMAC_MAC_HW_FEATURE1_DBGMEMA_WIDTH       (1U)
#define EMAC_MAC_HW_FEATURE1_DBGMEMA(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_DBGMEMA_SHIFT)) & EMAC_MAC_HW_FEATURE1_DBGMEMA_MASK)

#define EMAC_MAC_HW_FEATURE1_AVSEL_MASK          (0x100000U)
#define EMAC_MAC_HW_FEATURE1_AVSEL_SHIFT         (20U)
#define EMAC_MAC_HW_FEATURE1_AVSEL_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_AVSEL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_AVSEL_SHIFT)) & EMAC_MAC_HW_FEATURE1_AVSEL_MASK)

#define EMAC_MAC_HW_FEATURE1_RAVSEL_MASK         (0x200000U)
#define EMAC_MAC_HW_FEATURE1_RAVSEL_SHIFT        (21U)
#define EMAC_MAC_HW_FEATURE1_RAVSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE1_RAVSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_RAVSEL_SHIFT)) & EMAC_MAC_HW_FEATURE1_RAVSEL_MASK)

#define EMAC_MAC_HW_FEATURE1_POUOST_MASK         (0x800000U)
#define EMAC_MAC_HW_FEATURE1_POUOST_SHIFT        (23U)
#define EMAC_MAC_HW_FEATURE1_POUOST_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE1_POUOST(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_POUOST_SHIFT)) & EMAC_MAC_HW_FEATURE1_POUOST_MASK)

#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK      (0x3000000U)
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT     (24U)
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ_WIDTH     (2U)
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT)) & EMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK)

#define EMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK       (0x78000000U)
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT      (27U)
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM_WIDTH      (4U)
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT)) & EMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE2 - MAC Hardware Feature 2 */
/*! @{ */

#define EMAC_MAC_HW_FEATURE2_RXQCNT_MASK         (0xFU)
#define EMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT        (0U)
#define EMAC_MAC_HW_FEATURE2_RXQCNT_WIDTH        (4U)
#define EMAC_MAC_HW_FEATURE2_RXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT)) & EMAC_MAC_HW_FEATURE2_RXQCNT_MASK)

#define EMAC_MAC_HW_FEATURE2_TXQCNT_MASK         (0x3C0U)
#define EMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT        (6U)
#define EMAC_MAC_HW_FEATURE2_TXQCNT_WIDTH        (4U)
#define EMAC_MAC_HW_FEATURE2_TXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT)) & EMAC_MAC_HW_FEATURE2_TXQCNT_MASK)

#define EMAC_MAC_HW_FEATURE2_RXCHCNT_MASK        (0xF000U)
#define EMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT       (12U)
#define EMAC_MAC_HW_FEATURE2_RXCHCNT_WIDTH       (4U)
#define EMAC_MAC_HW_FEATURE2_RXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT)) & EMAC_MAC_HW_FEATURE2_RXCHCNT_MASK)

#define EMAC_MAC_HW_FEATURE2_TXCHCNT_MASK        (0x3C0000U)
#define EMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT       (18U)
#define EMAC_MAC_HW_FEATURE2_TXCHCNT_WIDTH       (4U)
#define EMAC_MAC_HW_FEATURE2_TXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT)) & EMAC_MAC_HW_FEATURE2_TXCHCNT_MASK)

#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK      (0x7000000U)
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT     (24U)
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM_WIDTH     (3U)
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT)) & EMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK)

#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK     (0x70000000U)
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT    (28U)
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_WIDTH    (3U)
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT)) & EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE3 - MAC Hardware Feature 3 */
/*! @{ */

#define EMAC_MAC_HW_FEATURE3_NRVF_MASK           (0x7U)
#define EMAC_MAC_HW_FEATURE3_NRVF_SHIFT          (0U)
#define EMAC_MAC_HW_FEATURE3_NRVF_WIDTH          (3U)
#define EMAC_MAC_HW_FEATURE3_NRVF(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_NRVF_SHIFT)) & EMAC_MAC_HW_FEATURE3_NRVF_MASK)

#define EMAC_MAC_HW_FEATURE3_CBTISEL_MASK        (0x10U)
#define EMAC_MAC_HW_FEATURE3_CBTISEL_SHIFT       (4U)
#define EMAC_MAC_HW_FEATURE3_CBTISEL_WIDTH       (1U)
#define EMAC_MAC_HW_FEATURE3_CBTISEL(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_CBTISEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_CBTISEL_MASK)

#define EMAC_MAC_HW_FEATURE3_DVLAN_MASK          (0x20U)
#define EMAC_MAC_HW_FEATURE3_DVLAN_SHIFT         (5U)
#define EMAC_MAC_HW_FEATURE3_DVLAN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE3_DVLAN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_DVLAN_SHIFT)) & EMAC_MAC_HW_FEATURE3_DVLAN_MASK)

#define EMAC_MAC_HW_FEATURE3_PDUPSEL_MASK        (0x200U)
#define EMAC_MAC_HW_FEATURE3_PDUPSEL_SHIFT       (9U)
#define EMAC_MAC_HW_FEATURE3_PDUPSEL_WIDTH       (1U)
#define EMAC_MAC_HW_FEATURE3_PDUPSEL(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_PDUPSEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_PDUPSEL_MASK)

#define EMAC_MAC_HW_FEATURE3_FRPSEL_MASK         (0x400U)
#define EMAC_MAC_HW_FEATURE3_FRPSEL_SHIFT        (10U)
#define EMAC_MAC_HW_FEATURE3_FRPSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE3_FRPSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_FRPSEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_FRPSEL_MASK)

#define EMAC_MAC_HW_FEATURE3_FRPBS_MASK          (0x1800U)
#define EMAC_MAC_HW_FEATURE3_FRPBS_SHIFT         (11U)
#define EMAC_MAC_HW_FEATURE3_FRPBS_WIDTH         (2U)
#define EMAC_MAC_HW_FEATURE3_FRPBS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_FRPBS_SHIFT)) & EMAC_MAC_HW_FEATURE3_FRPBS_MASK)

#define EMAC_MAC_HW_FEATURE3_FRPES_MASK          (0x6000U)
#define EMAC_MAC_HW_FEATURE3_FRPES_SHIFT         (13U)
#define EMAC_MAC_HW_FEATURE3_FRPES_WIDTH         (2U)
#define EMAC_MAC_HW_FEATURE3_FRPES(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_FRPES_SHIFT)) & EMAC_MAC_HW_FEATURE3_FRPES_MASK)

#define EMAC_MAC_HW_FEATURE3_ESTSEL_MASK         (0x10000U)
#define EMAC_MAC_HW_FEATURE3_ESTSEL_SHIFT        (16U)
#define EMAC_MAC_HW_FEATURE3_ESTSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE3_ESTSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_ESTSEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_ESTSEL_MASK)

#define EMAC_MAC_HW_FEATURE3_ESTDEP_MASK         (0xE0000U)
#define EMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT        (17U)
#define EMAC_MAC_HW_FEATURE3_ESTDEP_WIDTH        (3U)
#define EMAC_MAC_HW_FEATURE3_ESTDEP(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT)) & EMAC_MAC_HW_FEATURE3_ESTDEP_MASK)

#define EMAC_MAC_HW_FEATURE3_ESTWID_MASK         (0x300000U)
#define EMAC_MAC_HW_FEATURE3_ESTWID_SHIFT        (20U)
#define EMAC_MAC_HW_FEATURE3_ESTWID_WIDTH        (2U)
#define EMAC_MAC_HW_FEATURE3_ESTWID(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_ESTWID_SHIFT)) & EMAC_MAC_HW_FEATURE3_ESTWID_MASK)

#define EMAC_MAC_HW_FEATURE3_FPESEL_MASK         (0x4000000U)
#define EMAC_MAC_HW_FEATURE3_FPESEL_SHIFT        (26U)
#define EMAC_MAC_HW_FEATURE3_FPESEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE3_FPESEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_FPESEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_FPESEL_MASK)

#define EMAC_MAC_HW_FEATURE3_TBSSEL_MASK         (0x8000000U)
#define EMAC_MAC_HW_FEATURE3_TBSSEL_SHIFT        (27U)
#define EMAC_MAC_HW_FEATURE3_TBSSEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE3_TBSSEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_TBSSEL_SHIFT)) & EMAC_MAC_HW_FEATURE3_TBSSEL_MASK)

#define EMAC_MAC_HW_FEATURE3_ASP_MASK            (0x30000000U)
#define EMAC_MAC_HW_FEATURE3_ASP_SHIFT           (28U)
#define EMAC_MAC_HW_FEATURE3_ASP_WIDTH           (2U)
#define EMAC_MAC_HW_FEATURE3_ASP(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE3_ASP_SHIFT)) & EMAC_MAC_HW_FEATURE3_ASP_MASK)
/*! @} */

/*! @name MAC_DPP_FSM_INTERRUPT_STATUS - MAC DPP FSM Interrupt Status */
/*! @{ */

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK (0x4U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT (2U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_WIDTH (1U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK)

